<a href="https://colab.research.google.com/github/karabomaboka/Data-Science-Projects/blob/master/Missing_Values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
people_data=[{'Karabo': 45 ,'William':55} ,{'Karabo':65,'William':60,'Karabo':20} ,{'Karabo':75,'William':85} ,{'Karabo':45, 'William':55,'Karabo':95},{'Karabo':20,'William':35}]

dataframe1=pd.DataFrame(people_data,index=['A','B','C','D','E'], columns =['Karabo' ,'William'])

DropNaN=dataframe1.dropna()
print(DropNaN)

   Karabo  William
A      45       55
B      20       60
C      75       85
D      95       55
E      20       35

In [0]:
dataframe1.fillna(20)

   Karabo  William
A      45       55
B      20       60
C      75       85
D      95       55
E      20       35